count1 = 2
count2 = 4

print(count1 ** 2 + count2)
print((count2 - count1) ** 3)
print((count2 / count1) + 6)
print(count1 * count2)

LIKE_COUNT = 11
print(f"You like count: {LIKE_COUNT}")

#Лекция
#Констант не сущетсвует в Python, все просто договорились писать их капсом
#Символы "**" - возведение числа в степень
#Деление всегда возвращает вещественный тип данных (даже если делишь целые числа)
#Символ "_" игнорируется, можно использовать для записи больших чисел 14_000_000 (результат: 14000000)
#Множественное присваивание: x, y, z = 0, 0, 0
#Порядок вычисления - как в обычной математике, можно использовать () для корректировки